Autodesk.Revit.Creation.Document.NewTakeoffFitting(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.MEPCurve)
Add a new family instance of an takeoff fitting into the Autodesk Revit document,
using one connector and one MEP curve.
connector: The connector to be connected to the takeoff.
curve: The duct or pipe which is the trunk for the takeoff.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or curve is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the connector and the curve cannot be used for takeoff creation. For example,
they must be of the same domain, the curve must be a duct or pipe,
and the owner of the connector should be (flex) duct or pipe.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when takeoff fitting cannot be created.
Returns: If creation was successful then an family instance to the new object is returned,
otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the curve does not exist in the given document.

Autodesk.Revit.Creation.Document.NewUnionFitting(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Add a new family instance of an union fitting into the Autodesk Revit document,
using two connectors.
connector1: The first connector to be connected to the union.
connector2: The second connector to be connected to the union.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or connector2 is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the connectors cannot be used for union creation. For example,
they cannot be from the same element, they must be of the same domain and shape,
and the owner of the connector1 should be a (flex) duct or pipe.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when union fitting cannot be created.
Returns: If creation was successful then an family instance to the new object is returned,
otherwise an exception with failure information will be thrown.

Autodesk.Revit.Creation.Document.NewCrossFitting(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Add a new family instance of a cross fitting into the Autodesk Revit document,
using four connectors.
connector1: The first connector to be connected to the cross.
connector2: The second connector to be connected to the cross.
connector3: The third connector to be connected to the cross.
connector4: The fourth connector to be connected to the cross.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1, connector2, connector3, or connector4 is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the connectors cannot be used for cross creation. For example,
they cannot be from the same element, they must be of the same domain,
and the owner of the connectors should be a (flex) duct or pipe.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when cross fitting cannot be created.
Returns: If creation was successful then an family instance to the new object is returned,
and the transition fitting will be added at the connectors' end if necessary,
otherwise an exception with failure information will be thrown.

Autodesk.Revit.Creation.Document.NewTransitionFitting(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Add a new family instance of an transition fitting into the Autodesk Revit document,
using two connectors.
connector1: The first connector to be connected to the transition.
connector2: The second connector to be connected to the transition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or connector2 is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the connectors cannot be used for transition creation. For example,
they cannot be from the same element, they must be of the same domain,
and the owner of connector1 should be a (flex) duct or pipe.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when transition fitting cannot be created.
Returns: If creation was successful then an family instance to the new object is returned,
otherwise an exception with failure information will be thrown.

Autodesk.Revit.Creation.Document.NewTeeFitting(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Add a new family instance of a tee fitting into the Autodesk Revit document,
using three connectors.
connector1: The first connector to be connected to the tee.
connector2: The second connector to be connected to the tee.
connector3: The third connector to be connected to the tee.
This should be connected to the branch of the tee.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1, connector2 or connector3 is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the connectors cannot be used for the tee creation. For example,
they cannot be from the same element, they must be of the same domain,
and the owner of the connectors should be a (flex) duct or pipe.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when tee fitting cannot be created.
Returns: If creation was successful then an family instance to the new object is returned,
and the transition fitting will be added at the connectors' end if necessary,
otherwise an exception with failure information will be thrown.

Autodesk.Revit.Creation.Document.NewElbowFitting(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Add a new family instance of an elbow fitting into the Autodesk Revit document,
using two connectors.
connector1: The first connector to be connected to the elbow.
connector2: The second connector to be connected to the elbow.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or connector2 is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the connectors cannot be used for the elbow creation. For example,
they cannot be from the same element, they must be of the same domain,
and the angle between them must fall within the valid range (typically 2 to 95 degrees).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when an elbow fitting cannot be created because the angle between the two connectors is too large or too small,
the connectors are not close enough together, or the connectors are placed at positions with too high of a tolerance.
Returns: If creation was successful then an family instance to the new object is returned,
otherwise an exception with failure information will be thrown.

Autodesk.Revit.Creation.Document.NewFlexPipe(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Plumbing.FlexPipeType)
Adds a new flexible pipe into the document,
using two connector, and flexible pipe type.
connector1:  The first connector to be connected to the pipe.
connector2:  The second connector to be connected to the pipe.
pipeType:  The type of the flexible pipe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or connector2 is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible pipe cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible pipe is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connectors are fitting or equipment connectors of the correct domain,
and if the connectors' direction match the direction of the flexible pipe to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain,
does not match the one of the input connectors, no connection will be established.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the flexible pipe type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFlexPipe(Autodesk.Revit.DB.Connector,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Plumbing.FlexPipeType)
Adds a new flexible pipe into the document,
using a connector, point array and pipe type.
connector:  The connector to be connected to the flexible pipe, including the end points.
points: The point array indicating the path of the flexible pipe.
pipeType:  The type of the flexible pipe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector or points is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible pipe cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible pipe is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connector is a fitting or equipment connector of the correct domain,
and if the connector's direction matches the direction of the flexible pipe to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain,
does not match the one of the input connector, no connection will be established.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the flexible pipe type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFlexPipe(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Plumbing.FlexPipeType)
Adds a new flexible pipe into the document.
Adds a new flexible pipe into the document,
using a point array and pipe type.
points: The point array indicating the path of the flexible pipe, including the end points.
pipeType:  The type of the flexible pipe.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument points is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible pipe cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible pipe is returned,
otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the flexible pipe type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFlexDuct(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Mechanical.FlexDuctType)
Adds a new flexible duct into the document,
using two connector, and duct type.
connector1:  The first connector to be connected to the duct.
connector2:  The second connector to be connected to the duct.
ductType:  The type of the flexible duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector1 or connector2 is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible duct is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connectors are fitting or equipment connectors of the correct domain,
and if the connectors' direction match the direction of the flexible duct to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain,
does not match the one of the input connector, no connection will be established.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the flexible duct type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFlexDuct(Autodesk.Revit.DB.Connector,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Mechanical.FlexDuctType)
Adds a new flexible duct into the document,
using a connector, point array and duct type.
connector:  The connector to be connected to the duct, including the end points.
points: The point array indicating the path of the flexible duct.
ductType:  The type of the flexible duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument connector or points is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible duct is returned,
otherwise an exception with failure information will be thrown.
Remarks: If the connector is a fitting or equipment connector of the correct domain,
and if the connector's direction matches the direction of the flexible duct to be created,
the connectors will be automatically connected. A transition fitting will be added
at the connector(s) if necessary. If the connector's type, domain,
does not match the one of the input connector, no connection will be established.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the flexible duct type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFlexDuct(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ},Autodesk.Revit.DB.Mechanical.FlexDuctType)
Adds a new flexible duct into the document.
Adds a new flexible duct into the document,
using a point array and duct type.
points: The point array indicating the path of the flexible duct, including the end points.
ductType:  The type of the flexible duct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument points is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the flexible duct cannot be created or regenerate fails.
Returns:  If creation was successful then a new flexible duct is returned,
otherwise an exception with failure information will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the flexible duct type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFamilyInstance(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document,
using a curve, type/symbol and reference level.
curve: The curve where the instance is based.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
level: A Level object that is used as the base level for the object.
structuralType:  If structural then specify the type of the component.
Returns: If creation was successful then an instance to the new object is returned, otherwise null.
Remarks: This method is used to insert one family instance into another element along the geometry of a curve.
If the instance fails to be created an
exception may be thrown.
The type/symbol that is used must be loaded into the document before this
method is called. Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods. The host object must be one that supports insertion of
instances otherwise this method will fail. All levels within the document can be found by iterating
over the entire document and searching for objects of type Autodesk.Revit.Elements.Level.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the family symbol does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if The symbol is not active.

Autodesk.Revit.Creation.Document.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document, using a location,
type/symbol and a base level.
location: The physical location where the instance is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
level: A Level object that is used as the base level for the object.
structuralType:  If structural then specify the type of the component.
Returns: If creation was successful then an instance to the new object is returned, otherwise null.
Remarks: This method is used to add a family instance that doesn't require a host element, but that can be associated
to a level.  If the instance fails to be created an exception may be thrown.
The type/symbol that is used must be loaded into the document before this
method is called. Families and their symbols can be loaded using the Document.LoadFamily or
Document.LoadFamilySymbol methods. All levels within the document can be found by iterating
over the entire document and searching for objects of type Autodesk.Revit.Elements.Level.Some families, such as Beams, have more than one endpoint and are inserted in the same manner as single
point instances. Once inserted these linear family instances can have their endpoints changed by
using the instance's Element.Location property.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the family symbol does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if The symbol is not active.

Autodesk.Revit.Creation.Document.NewFamilyInstance(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
Inserts a new instance of a family into the document,
using a location, type/symbol, the host element and a base level.
location: The physical location where the instance is to be placed on the specified level.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.
host:  A host object into which the instance will be embedded
level: A Level object that is used as the base level for the object.
structuralType:  If structural then specify the type of the component.
Returns: If creation was successful then an instance to the new object is returned, otherwise null.
Remarks: This form of NewFamilyInstance is the most commonly used in Autodesk Revit since there are
a large number of elements that use levels, such as Walls, Columns etc. If the instance fails to
be created an exception may be thrown.
The type/symbol that is used must be loaded into the document
before this method is called. Families and their symbols can be loaded using the Document.LoadFamily
or Document.LoadFamilySymbol methods. All levels within the document can be found by iterating over
the entire document and searching for objects of type Autodesk.Revit.Elements.Level. Some Families, such as Beams, have more than one endpoint and are inserted in the same manner as single point
instances. Once inserted these linear family instances can have their endpoints changed by using
the instance's Element.Location property.Note: ForbiddenForDynamicUpdateException might be thrown during a dynamic update if the inserted instance establishes a mutual dependency with another structure.Note: if the created family instance includes nested instances, the API framework will automatically regenerate
the document during this method call.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the family symbol does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the host does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if The symbol is not active.

Autodesk.Revit.Creation.Document.NewFascia(Autodesk.Revit.DB.Architecture.FasciaType,Autodesk.Revit.DB.Reference)
Creates a fascia along a reference.
FasciaType:  The type of the fascia to create
reference:  A planar line or arc that represents the place where you
want to place the fascia.
Returns:  If successful a new fascia object within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the fascia type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFascia(Autodesk.Revit.DB.Architecture.FasciaType,Autodesk.Revit.DB.ReferenceArray)
Creates a fascia.
Creates a fascia along a reference array.
FasciaType:  The type of the fascia to create
references:  An array of planar lines and arcs that represents the place where you
want to place the fascia.
Returns:  If successful a new fascia object within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the fascia type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewGutter(Autodesk.Revit.DB.Architecture.GutterType,Autodesk.Revit.DB.Reference)
Creates a gutter along a reference.
GutterType:  The type of the gutter to create
reference:  A planar line or arc that represents the place where you
want to place the gutter.
Returns:  If successful a new gutter object within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the gutter type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewGutter(Autodesk.Revit.DB.Architecture.GutterType,Autodesk.Revit.DB.ReferenceArray)
Creates a gutter.
Creates a gutter along a reference array.
GutterType:  The type of the gutter to create
references:  An array of planar lines and arcs that represents the place where you
want to place the gutter.
Returns:  If successful a new gutter object within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the gutter type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewSlabEdge(Autodesk.Revit.DB.SlabEdgeType,Autodesk.Revit.DB.Reference)
Creates a slab edge along a reference.
SlabEdgeType:  The type of the slab edge to create
reference:  A planar line or arc that represents the place where you
want to place the slab edge.
Returns:  If successful a new slab edge object within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the slab edge type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewSlabEdge(Autodesk.Revit.DB.SlabEdgeType,Autodesk.Revit.DB.ReferenceArray)
Creates a slab edge.
Creates a slab edge along a reference array.
SlabEdgeType:  The type of the slab edge to create
references:  An array of planar lines and arcs that represents the place where you
want to place the slab edge.
Returns:  If successful a new slab edge object within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the slab edge type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewCurtainSystem(Autodesk.Revit.DB.FaceArray,Autodesk.Revit.DB.CurtainSystemType)
Creates a new CurtainSystem element from a set of faces.
faces: The faces new CurtainSystem will be created on.
curtainSystemType: The Type of CurtainSystem to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown in following cases:
The input argument faces or curtainSystemType is null.
The size of faces is zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the CurtainSystem cannot be created or regenerate fails.
Returns:  The CurtainSystem created will be returned when the operation succeeds.
Remarks:  The input faces will be copied during the operations so that they can be any
faces.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the curtain system type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewCurtainSystem2(Autodesk.Revit.DB.ReferenceArray,Autodesk.Revit.DB.CurtainSystemType)
Creates a new CurtainSystem element.
Creates a new CurtainSystem element from a set of face references.
faces: The faces new CurtainSystem will be created on.
curtainSystemType: The Type of CurtainSystem to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown in following cases:
The input argument faces or curtainSystemType is null.
The size of faces is zero.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the CurtainSystem cannot be created, for example, the input faces don't
belong to same mass or generic model. Or regenerate fails.
Returns:  A set of ElementIds of CurtainSystems will be returned when the operation succeeds.
Remarks:  The faces can belong to different masses or generic models. The number of CurtainSystems will be equal to the number of masses and generic models.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the curtain system type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewZone(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Phase)
Creates a new Zone element.
level:  The level on which the Zone is to exist.
phase:  The associative phase on which the Zone is to exist.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the specified parameter Value is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the electrical system cannot be created by these input phase and level.
Returns:  If successful a new Zone element within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the phase does not exist in the given document.

Autodesk.Revit.Creation.Document.NewRoomBoundaryLines(Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.View)
Creates a new boundary line as an Room border.
sketchPlane: The sketch plan
curves: The geometry curves on which the boundary lines are
view: The View for the new Room
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the sketch plane does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the view does not exist in the given document.

Autodesk.Revit.Creation.Document.NewSpaceBoundaryLines(Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.View)
Creates a new boundary line as an Space border.
sketchPlane: The sketch plan
curves: The geometry curves on which the boundary lines are
view: The View for the new Space
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the sketch plane does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the view does not exist in the given document.

Autodesk.Revit.Creation.Document.NewSpaceTag(Autodesk.Revit.DB.Mechanical.Space,Autodesk.Revit.DB.UV,Autodesk.Revit.DB.View)
Creates a new SpaceTag.
space:  The Space which the tag refers.
point:  A 2D point that dictates the location on the level of the space.
view:  The view where the tag will lie.
Returns:  If successful a SpaceTag object will be returned, otherwise null.
Suitable exceptions will be fired if the parameters are invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the space does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the view does not exist in the given document.

Autodesk.Revit.Creation.Document.NewSpaces2(Autodesk.Revit.DB.Phase,System.Int32)
Creates a set of new unplaced spaces on a given phase.
phase:  The phase in which the spaces are to exist.
Returns:  If successful, a set of ElementIds of new unplaced spaces are be returned, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the phase does not exist in the given document.

Autodesk.Revit.Creation.Document.NewSpaces2(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Phase,Autodesk.Revit.DB.View)
Creates one or more spaces.
Creates new spaces on the available plan circuits of a the given level.
level:  The level on which the spaces is to exist.
phase:  The phase in which the spaces is to exist.
view:  The view on which the space tags for the spaces are to display.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: The view of the relevant level can not be retrieved.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The phase is invalid or regeneration fails at the end of the creation.
Returns:  If successful, a set of ElementIds which contains the rooms should be returned, otherwise the exception will be thrown.
Remarks:  This method will regenerate the document even in manual regeneration mode.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the phase does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the view does not exist in the given document.

Autodesk.Revit.Creation.Document.NewSpace(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Phase,Autodesk.Revit.DB.UV)
Creates a new space element on the given level, at the given location, and assigned to the given phase.
level:  The level on which the room is to exist.
phase:  The phase in which the room is to exist.
point:  A 2D point that dictates the location on that specified level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when level, phase or point is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the space cannot be created.
Returns:  If successful a new Space element within the project, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the phase does not exist in the given document.

Autodesk.Revit.Creation.Document.NewSpace(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.UV)
Creates a new space element on the given level at the given location.
level:  The level on which the space is to exist.
point:  A 2D point that dictates the location on that specified level.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when level or point is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the space cannot be created.
Returns:  If successful the new space element is returned, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.

Autodesk.Revit.Creation.Document.NewSpace(Autodesk.Revit.DB.Phase)
Creates a new space.
Creates a new unplaced space on a given phase.
phase:  The phase in which the space is to exist.
Returns:  If successful the new space should be returned, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the phase does not exist in the given document.

Autodesk.Revit.Creation.Document.NewPipingSystem(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.ConnectorSet,Autodesk.Revit.DB.Plumbing.PipeSystemType)
Creates a new MEP piping system element.
baseEquipmentConnector:
One connector within base equipment which is used to connect with the system.
The base equipment is optional for the system, so this argument may be null.
The baseEquipmentConnector should not be included in the connectors.
connectors:
Connectors that will connect to the system.
The owner elements of these connectors will be added into system as its elements.
pipingSystemType: The System type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when calling this function outside of the Autodesk Revit MEP product.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the connectors parameter value is null.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the pipingSystemType parameter value is out of permitted scope.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when some connectors can't be used to create the mechanical system.
All the input connectors and base equipment connector should match system type and domain with the system,
and they should not have been used in another system.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the piping system creation failed.
Returns:
If creation was successful then an instance of piping system is returned,
otherwise an exception with information will be thrown.
Remarks:  This method will regenerate the document even in manual regeneration mode.

Autodesk.Revit.Creation.Document.NewMechanicalSystem(Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.ConnectorSet,Autodesk.Revit.DB.Mechanical.DuctSystemType)
Creates a new MEP mechanical system element.
baseEquipmentConnector:
One connector within base equipment which is used to connect with the system.
The base equipment is optional for the system, so this argument may be null.
The baseEquipmentConnector should not be included in the connectors.
connectors:
Connectors that will connect to the system.
The owner elements of these connectors will be added into system as its elements.
ductSystemType: The system type.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when calling this function outside of the Autodesk Revit MEP product.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input connectors parameter value is null.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown when the ductSystemType parameter is out of permitted scope.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when some connectors can't be used to create the mechanical system.
All the input connectors and base equipment connector should match system type and domain with the system,
and they should not have been used in another system.
The owner of BaseConnector should be a mechanical equipment, and the owner of other connectors should be a mechanical equipment or air terminal.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the mechanical system creation failed.
Returns:
If creation was successful then an instance of mechanical system is returned,
otherwise an exception with information will be thrown.
Remarks:  This method will regenerate the document even in manual regeneration mode.

Autodesk.Revit.Creation.Document.NewExtrusionRoof(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.ReferencePlane,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.RoofType,System.Double,System.Double)
Creates a new Extrusion Roof.
profile: The profile of the extrusion roof. The curves of the profile must be contiguous and form one open loop without self-intersections. The profile curves must lie in the %refPlane% parallel to z-axis.
refPlane: The work plane for the extrusion roof. It must be parallel to z-axis.
level: The level of the extrusion roof.
roofType: Type of the extrusion roof.
extrusionStart: Start the extrusion. Measured from %refPlane% in the direction of the plane normal.
extrusionEnd: End the extrusion. Measured from %refPlane% in the direction of the plane normal.
Remarks:  This method will regenerate the document even in manual regeneration mode.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the work plane does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the roof type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFootPrintRoof(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.RoofType,Autodesk.Revit.DB.ModelCurveArray@)
Creates a new FootPrintRoof element.
footPrint: The footprint of the FootPrintRoof.
level: The level of the FootPrintRoof.
roofType: Type of the FootPrintRoof.
footPrintToModelCurvesMapping: An array of Model Curves corresponding to the set of Curves input in the footPrint. By knowing which Model Curve was created by each footPrint curve, you can set properties like SlopeAngle for each curve.
Remarks:  This method will regenerate the document even in manual regeneration mode.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the roof type does not exist in the given document.

Autodesk.Revit.Creation.Document.NewAreas(System.Collections.Generic.List{Autodesk.Revit.Creation.AreaCreationData})
Creates new areas
dataList: A list of AreaCreationData which wraps the creation arguments of the areas to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:  If AreaCreationData's areaPoint is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the area cannot be created successfully or the phase is invalid or regeneration fails at the end of the batch creation.
Returns:  If successful an Element Set which contains the areas should be returned, otherwise the exception will be thrown.

Autodesk.Revit.Creation.Document.NewArea(Autodesk.Revit.DB.ViewPlan,Autodesk.Revit.DB.UV)
Creates a new area
areaView: The view of area element.
point: The point which lies in the enclosed region of AreaBoundaryLines to put the new created Area
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the area view does not exist in the given document.

Autodesk.Revit.Creation.Document.NewAreaTag(Autodesk.Revit.DB.ViewPlan,Autodesk.Revit.DB.Area,Autodesk.Revit.DB.UV)
Creates a new area tag.
areaView: The area view
room: The area to tag
point: The position of the area tag
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the area view does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the area does not exist in the given document.

Autodesk.Revit.Creation.Document.NewAreaBoundaryLine(Autodesk.Revit.DB.SketchPlane,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.ViewPlan)
Creates a new boundary line as an Area border.
sketchPlane: The sketch plane.
geometryCurve: The geometry curve on which the boundary line are
areaView: The View for the new Area
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the sketch plane does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the area view does not exist in the given document.

Autodesk.Revit.Creation.Document.NewSlab(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Line,System.Double,System.Boolean)
Creates a slab within the project with the given horizontal profile using the default floor style.
profile:  An array of planar lines and arcs that represent the horizontal profile of the slab.
level: The level on which the slab is to be placed.
slopedArrow:  A line use to control the sloped angle of the slab. It should be in the same face with profile.
slope:  The slope.
isStructural:  If set, specifies that the floor is structural in nature.
Returns:  If successful a new floor object within the project, otherwise null.
Remarks:  The curves of the profile must be contiguous and
the Face formed by profile should be suitable to create slab.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.

Autodesk.Revit.Creation.Document.NewOpening(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.CurveArray,System.Boolean)
Creates a new opening in a roof, floor and ceiling.
hostElement:  Host element of the opening. Can be a roof, floor, or ceiling.
profile:  Profile of the opening.
bPerpendicularFace: True if the profile is cut perpendicular to the intersecting face of the host. False if the profile is cut vertically.
Returns:  If successful, an Opening object is returned.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the host element does not exist in the given document.

Autodesk.Revit.Creation.Document.NewOpening(Autodesk.Revit.DB.Wall,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a rectangular opening on a wall.
wall:  Host element of the opening.
pntStart: One corner of the rectangle.
pntEnd: The opposite corner of the rectangle.
Returns:  If successful, an Opening object is returned.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the wall does not exist in the given document.

Autodesk.Revit.Creation.Document.NewOpening(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.CurveArray)
Creates a new shaft opening between a set of levels.
bottomLevel:  bottom level
topLevel:  top level
profile:  profile of the opening.
Returns:  If successful, an Opening object is returned.
Remarks:  This method forms an opening on floor, ceiling and roof. Make sure topLevel is higher than bottomLevel, otherwise an exception will be returned.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the bottom level does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the top level does not exist in the given document.

Autodesk.Revit.Creation.Document.NewOpening(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.CurveArray,Autodesk.Revit.Creation.eRefFace)
Creates a new opening.
Creates a new opening in a beam, brace and column.
famInstElement:  host element of the opening, can be a beam, brace and column.
profile:  profile of the opening.
iFace:  face on which opening is based on.
Returns:  If successful, an Opening object is returned.
Remarks:  This method forms opening on a beam, brace and column.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the family instance element does not exist in the given document.

Autodesk.Revit.Creation.Document.NewAreaBoundaryConditions(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new Area BoundaryConditions element on a host element.
hostElement:  A Wall, Slab or Slab Foundation to host the boundary conditions.
X_Translation:  A value indicating the X axis translation option.
X_TranslationSpringModulus:  Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:  A value indicating the Y axis translation option.
Y_TranslationSpringModulus:  Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:  A value indicating the Z axis translation option.
Z_TranslationSpringModulus:  Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
Returns: If successful, NewAreaBoundaryConditions returns an object for the newly created BoundaryConditions
with the BoundaryType = 2 - "Area". null is returned if the operation fails.
Remarks: This method will only function with the Autodesk Revit Structure application.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the host element does not exist in the given document.

Autodesk.Revit.Creation.Document.NewLineBoundaryConditions(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new Line BoundaryConditions element on a host element.
hostElement:  A Beam.
X_Translation:  A value indicating the X axis translation option.
X_TranslationSpringModulus:  Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:  A value indicating the Y axis translation option.
Y_TranslationSpringModulus:  Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:  A value indicating the Z axis translation option.
Z_TranslationSpringModulus:  Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
X_Rotation:  A value indicating the option for rotation about the X axis.
X_RotationSpringModulus:  Rotation Spring Modulus for X axis. Ignored if X_Rotation is not "Spring"
Returns: If successful, NewLineBoundaryConditions returns an object for the newly created BoundaryConditions
with the BoundaryType = 1 - "Line". null is returned if the operation fails.
Remarks: This method will only function with the Autodesk Revit Structure application.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the host element does not exist in the given document.

Autodesk.Revit.Creation.Document.NewAreaBoundaryConditions(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new Area BoundaryConditions element.
Creates a new Area BoundaryConditions element on a reference.
reference:  The Geometry reference obtained from a Wall, Slab or
Slab Foundation.
X_Translation:  A value indicating the X axis translation option.
X_TranslationSpringModulus:  Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:  A value indicating the Y axis translation option.
Y_TranslationSpringModulus:  Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:  A value indicating the Z axis translation option.
Z_TranslationSpringModulus:  Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
Returns: If successful, NewAreaBoundaryConditions returns an object for the newly created BoundaryConditions
with the BoundaryType = 2 - "Area". null is returned if the operation fails.
Remarks: This method will only function with the Autodesk Revit Structure application.

Autodesk.Revit.Creation.Document.NewLineBoundaryConditions(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new Line BoundaryConditions element.
Creates a new Line BoundaryConditions element on a reference.
reference:  The Geometry reference to a Beam's, Wall's, Wall Foundation's, Slab's or
Slab Foundation's analytical line.
X_Translation:  A value indicating the X axis translation option.
X_TranslationSpringModulus:  Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:  A value indicating the Y axis translation option.
Y_TranslationSpringModulus:  Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:  A value indicating the Z axis translation option.
Z_TranslationSpringModulus:  Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
X_Rotation:  A value indicating the option for rotation about the X axis.
X_RotationSpringModulus:  Rotation Spring Modulus for X axis. Ignored if X_Rotation is not "Spring"
Returns: If successful, NewLineBoundaryConditions returns an object for the newly created BoundaryConditions
with the BoundaryType = 1 - "Line". null is returned if the operation fails.
Remarks: This method will only function with the Autodesk Revit Structure application.

Autodesk.Revit.Creation.Document.NewPointBoundaryConditions(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double,Autodesk.Revit.DB.Structure.TranslationRotationValue,System.Double)
Creates a new Point BoundaryConditions Element.
reference:  A Geometry reference to a Beam's, Brace's or Column's analytical line end.
X_Translation:  A value indicating the X axis translation option.
X_TranslationSpringModulus:  Translation Spring Modulus for X axis. Ignored if X_Translation is not "Spring".
Y_Translation:  A value indicating the Y axis translation option.
Y_TranslationSpringModulus:  Translation Spring Modulus for Y axis. Ignored if Y_Translation is not "Spring".
Z_Translation:  A value indicating the Z axis translation option.
Z_TranslationSpringModulus:  Translation Spring Modulus for Z axis. Ignored if Z_Translation is not "Spring".
X_Rotation:  A value indicating the option for rotation about the X axis.
X_RotationSpringModulus:  Rotation Spring Modulus for X axis. Ignored if X_Rotation is not "Spring".
Y_Rotation:  A value indicating the option for rotation about the Y axis.
Y_RotationSpringModulus:  Rotation Spring Modulus for Y axis. Ignored if Y_Rotation is not "Spring".
Z_Rotation:  A value indicating the option for rotation about the Z axis.
Z_RotationSpringModulus:  Rotation Spring Modulus for Z axis. Ignored if Y_Rotation is not "Spring".
Returns: If successful, NewPointBoundaryConditions returns an object for the newly created BoundaryConditions
with the BoundaryType = 0 - "Point". null is returned if the operation fails.
Remarks: This method will only function with the Autodesk Revit Structure application.

Autodesk.Revit.Creation.Document.NewRoomTag(Autodesk.Revit.DB.LinkElementId,Autodesk.Revit.DB.UV,Autodesk.Revit.DB.ElementId)
Creates a new RoomTag referencing a room in the host model or in a Revit link.
roomId:  The HostOrLinkElementId of the Room.
point:  A 2D point that defines the tag location on the level of the room.
viewId:  The id of the view where the tag will be shown. If null and the room in not in a Revit link, the view of the room will be used.
Returns:  If successful a RoomTag object will be returned, otherwise null.
Since: 2014
Throws Autodesk.Revit.Exceptions.ArgumentException: viewId is not associated with a plan view or section view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: viewId is null and the room is in a linked file.

Autodesk.Revit.Creation.Document.NewRooms2(Autodesk.Revit.DB.Phase,System.Int32)
Creates new unplaced rooms in the given phase.
phase:  The phase on which the rooms are to exist.
count:  The number of the rooms to be created.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the room can not be created successfully or regeneration fails at the end of the creation.
Returns:  If successful, a set of ElementIds which contains the rooms should be returned, otherwise the exception will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the phase does not exist in the given document.

Autodesk.Revit.Creation.Document.NewRooms2(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Phase)
Creates new rooms in each plan circuit found in the given level in the given phase.
level:  The level from which the circuits are found.
phase:  The phase on which the room is to exist.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:  If the view of the relevant level can not be retrieved.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the phase is invalid, or regeneration fails at the end of the creation.
Returns:  If successful, a set of ElementIds which contains the rooms should be returned, otherwise the exception will be thrown.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the phase does not exist in the given document.

Autodesk.Revit.Creation.Document.NewRooms2(Autodesk.Revit.DB.Level)
Creates new rooms in each plan circuit found in the given level in the last phase.
level:  The level from which the circuits are found.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:  If the view of the relevant level can not be retrieved.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the phase is invalid, or regeneration fails at the end of the creation.
Returns:  If successful, a set of ElementIds which contains the rooms created should be returned, otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.

Autodesk.Revit.Creation.Document.NewRoom(Autodesk.Revit.DB.Architecture.Room,Autodesk.Revit.DB.PlanCircuit)
Creates a new room within the confines of a plan circuit, or places an unplaced room within the confines of the plan circuit.
room:  The room which you want to locate in the circuit.  Pass null to create a new room.
circuit:  The circuit in which you want to locate a room.
Returns:  If successful the room is returned, otherwise null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: If the existing room is already placed.
Remarks:  This method will regenerate the document even in manual regeneration mode.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the room does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the circuit does not exist in the given document.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown if the level obtained from the circuit has no associated view .

Autodesk.Revit.Creation.Document.NewRoom(Autodesk.Revit.DB.Phase)
Creates a new unplaced room and with an assigned phase.
phase:  The phase in which the room is to exist.
Returns:  If successful the new room , otherwise null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the phase does not exist in the given document.

Autodesk.Revit.Creation.Document.NewRoom(Autodesk.Revit.DB.Level,Autodesk.Revit.DB.UV)
Creates a new room.
Creates a new room on a level at a specified point.
level:  The level on which the room is to exist.
point:  A 2D point that dictates the location of the room on that specified level.
Returns:  If successful the new room will be returned, otherwise null.
Remarks:  This method will regenerate the document even in manual regeneration mode.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFoundationSlab(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.FloorType,Autodesk.Revit.DB.Level,System.Boolean,Autodesk.Revit.DB.XYZ)
Creates a foundation slab within the project with the given horizontal profile and floor style on the specified level.
profile:  An array of planar lines and arcs that represent the horizontal profile of the floor.
floorType:  A floor type to be used by the new floor instead of the default type.
level:  The level on which the floor is to be placed.
structural:  If set, specifies that the floor is structural in nature.
normal:  A vector that must be perpendicular to the profile which dictates which side of the floor is considered
to be upper and down.
Returns:  if successful, a new foundation slab object within the project, otherwise null.
Remarks:  The curves of the profile must be contiguous and
the Face formed by profile should be suitable to create floor.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the floor type does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFloor(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.FloorType,Autodesk.Revit.DB.Level,System.Boolean,Autodesk.Revit.DB.XYZ)
Creates a floor within the project with the given horizontal profile and floor style on the specified level with the specified normal vector.
profile:  An array of planar lines and arcs that represent the horizontal profile of the floor.
floorType:  A floor type to be used by the new floor instead of the default type.
level:  The level on which the floor is to be placed.
structural:  If set, specifies that the floor is structural in nature.
normal:  A vector that must be perpendicular to the profile which dictates which side of the floor is considered
to be upper and down.
Returns:  if successful, a new floor object within the project, otherwise null.
Remarks:  The curves of the profile must be contiguous and
the Face formed by profile should be suitable to create floor.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the floor type does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFloor(Autodesk.Revit.DB.CurveArray,Autodesk.Revit.DB.FloorType,Autodesk.Revit.DB.Level,System.Boolean)
Creates a floor within the project with the given horizontal profile and floor style on the specified level.
profile:  An array of planar lines and arcs that represent the horizontal profile of the floor.
floorType:  A floor type to be used by the new floor instead of the default type.
level:  The level on which the floor is to be placed.
structural:  If set, specifies that the floor is structural in nature.
Returns:  if successful, a new floor object within the project, otherwise null.
Remarks:  The curves of the profile must be contiguous and
the Face formed by profile should be suitable to create floor.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the floor type does not exist in the given document.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the level does not exist in the given document.

Autodesk.Revit.Creation.Document.NewFloor(Autodesk.Revit.DB.CurveArray,System.Boolean)
Creates a floor within the project.
Creates a floor within the project with the given horizontal profile using the default floor style.
profile:  An array of planar lines and arcs that represent the horizontal profile of the floor.
structural:  If set, specifies that the floor is structural in nature.
Returns:  If successful a new floor object within the project, otherwise null.
Remarks:  The curves of the profile must be contiguous and
the Face formed by profile should be suitable to create floor.

Autodesk.Revit.Creation.Document.NewSpotElevation(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Boolean)
Generate a new spot elevation object within the project.
view:  The view in which the spot elevation is to be visible.
reference:  The reference to which the spot elevation is to be bound.
origin:  The point which the spot elevation evaluate.
bend:  The bend point for the spot elevation.
end:  The end point for the spot elevation.
refPt:  The actual point on the reference which the spot elevation evaluate.
hasLeader:  Indicate if it has leader or not.
Returns:  If successful a new spot dimension object, otherwise null.
Remarks:  If the origin point is not on the reference, it'll be projected to the reference automatically. And the refPt
is the projected point. If the reference is not valid or the point cannot be projected to
reference correctly, an exception will be thrown
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the view does not exist in the given document.

Autodesk.Revit.Creation.Document.NewSpotCoordinate(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,System.Boolean)
Generate a new spot coordinate object within the project.
view:  The view in which the spot coordinate is to be visible.
reference:  The reference to which the spot coordinate is to be bound.
origin:  The point which the spot coordinate evaluate.
bend:  The bend point for the spot coordinate.
end:  The end point for the spot coordinate.
refPt:  The actual point on the reference which the spot coordinate evaluate.
hasLeader:  Indicate if it has leader or not.
Returns:  If successful a new spot dimension object, otherwise null.
Remarks:  If the origin point is not on the reference, it'll be projected to the reference automatically. And the refPt
is projected point. If the reference is not valid or the point cannot be projected to
reference correctly, an exception will be thrown
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the view does not exist in the given document.

Autodesk.Revit.Creation.Document
The Document Creation object is used to create new instances of elements within the
Autodesk Revit project.
Remarks: The Document Creation object is a utility object that is used to create new
instances of elements within the Autodesk Revit project. This object, available from the
Document.Create property should be used to create elements instead of using New. This
object ensures that the elements created are added to the document correctly.